tutorials/doubleMach/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        const scalar x_gap = 1.0/6.0;
        const scalar tan_60 = sqrt(3.0);
        scalarField rhoInit(mesh.nCells());
        forAll(rhoInit, cellI)
        {
            const scalar x = mesh.C()[cellI].x();
            const scalar y = mesh.C()[cellI].y();
            if ((x-x_gap)*tan_60 < y)
            {
                rhoInit[cellI] = 8;
            }
            else
            {
                rhoInit[cellI] = 1.4;
            }
        }
        writeEntry(os, rhoInit);
    #};
};

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform 0;
        name            rhoB;
        code
        #{
            const vectorField Cf = patch().Cf();
            scalarField& field = *this;
            scalar t = this->db().time().value();
            const scalar x_gap = 1.0/6.0;
            const scalar tan_60 = sqrt(3.0);
            const scalar d = 20.0/sqrt(3.0)*t;
            forAll(Cf, faceI)
            {
                const scalar x = Cf[faceI].x();
                const scalar y = Cf[faceI].y();
                if ((x-x_gap-d)*tan_60 < y)
                {
                    field[faceI] = 8;
                }
                else
                {
                    field[faceI] = 1.4;
                }
            }
         #};
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
