tutorials/doubleMach/constant/fluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fluidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  Euler;

gamma           1.4;

PrDyna          0.72;

PrTurb          0.9;

freeStream
{
    Pressure        101325.0;
    Mach            0.8;
    T               273.15;
    AOA             1.25;
}

// ************************************************************************* //
