tutorials/doubleMach/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0 0 0)                 //0
    (0.1666666666667 0 0)   //1
    (3 0 0)                 //2
    (3 1 0)                 //3
    (0.1666666666667 1 0)   //4
    (0 1 0)                 //5
    
    (0 0 0.1)               //6
    (0.1666666666667 0 0.1) //7
    (3 0 0.1)               //8
    (3 1 0.1)               //9
    (0.1666666666667 1 0.1) //10
    (0 1 0.1)               //11
);

blocks
(
    hex (0 1 4 5 6 7 10 11) (20 120 1) simpleGrading (1 1 1)
    hex (1 2 3 4 7 8 9 10) (340 120 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 11 5)
            (5 11 10 4)
            (4 10 9 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 7 6 0)
            (3 9 8 2)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (2 8 7 1)
        );
    }
);

// ************************************************************************* //
